import { Button, Typography } from "@mui/material";
import React, { useEffect, useState } from "react";

export default function DeleteNow() {
  const [myData, setMyData] = useState([
    {
      ans: "அ. ஜெர்மனி, ஆஸ்திரிய - ஹங்கேரி, உதுமானியர்",
      opt1: "அ. ஜெர்மனி, ஆஸ்திரிய - ஹங்கேரி, உதுமானியர்",
      opt2: "ஆ. ஜெர்மனி, ஆஸ்திரிய - ஹங்கேரி, ரஷ்யா",
      opt3: "இ. ஸ்பெயின், போர்ச்சுகல், இத்தாலி",
      opt4: "ஈ. ஜெர்மனி, ஆஸ்திரீய - ஹங்கேரி, இத்தாலி",
      qn1: "முதல் உலகப்போரின் இறுதியில் நிலைகுலைந்து போன மூன்று பெரும் பேரரசுகள் யாவை?",
    },
    {
      ans: "இ. அடோவா",
      opt1: "அ. டெல்வில்லி",
      opt2: "ஆ. ஆரஞ்சு நாடு",
      opt3: "இ. அடோவா",
      opt4: "ஈ. அல்ஜியர்ஸ்",
      qn2: "எவ்விடத்தில் எத்தியோப்பியாவின் படை இத்தாலியின் படைகளைத் தோற்கடித்தது?",
    },
    {
      ans: "ஆ. ஐப்பான்",
      opt1: "அ. சீனா",
      opt2: "ஆ. ஜப்பான்",
      opt3: "இ. கொரியா",
      opt4: "ஈ. மங்கோலியா",
      qn3: "பத்தொன்பதாம் நூற்றாண்டு முடிவடையுந்தருவாயில் கிழக்கு ஆசியாவில் உதயமான வலிமைவாய்ந்த நாடு எது?",
    },
    {
      ans: "அ. லெனின்",
      opt1: "அ. லெனின்",
      opt2: "ஆ. மார்க்ஸ்",
      opt3: "இ. சன் யாட் சென்",
      opt4: "ஈ. மா சே துங்",
      qn4: "“ஏகாதிபத்தியம் முதலாளித்துவத்தின் உச்சக்கட்டம்” எனக் கூறியவர் யார்?",
    },
    {
      ans: "ஆ. பதுங்குக் குழிப்போர்முறை",
      opt1: "அ. ஆகாயப் போர்முறை",
      opt2: "ஆ. பதுங்குக் குழிப்போர்முறை",
      opt3: "இ. நீர்மூழ்கிக்கப்பல் போர்முறை",
      opt4: "ஈ. கடற்படைப் போர்முறை",
      qn5: "மார்ன் போர் எதற்காக நினைவு கூறப்படுகிறது?",
    },
    {
      ans: "ஈ. அமெரிக்க ஐக்கிய நாடுகள்",
      opt1: "அ. பிரிட்டன்",
      opt2: "ஆ. பிரான்ஸ்",
      opt3: "இ. ஜெர்மனி",
      opt4: "ஈ. அமெரிக்க ஐக்கிய நாடுகள்",
      qn6: "எந்த நாடு முதல் உலகப்போருக்குப் பின்னர் தனித்திருக்கும் கொள்கையைக் கைக்கொண்டது?",
    },
    {
      ans: "அ. பிரிட்டன்",
      opt1: "அ. பிரிட்டன்",
      opt2: "ஆ. பிரான்ஸ்",
      opt3: "இ. டச்சு",
      opt4: "ஈ. அமெரிக்க ஐக்கிய நாடுகள்",
      qn7: "சர்வதேச சங்கத்தின் முதல் பொதுச்செயலர் எந்த நாட்டைச் சேர்ந்தவர்?",
    },
    {
      ans: "ஆ. ரஷ்யா",
      opt1: "அ. ஜெர்மனி",
      opt2: "ஆ. ரஷ்யா",
      opt3: "இ. இத்தாலி",
      opt4: "ஈ. பிரான்ஸ்",
      qn8: "பின்லாந்தைத் தாக்கியதற்காக சர்வதேச சங்கத்திலிருந்து வெளியேற்றப்பட்ட நாடு எது?",
    },
    {
      ans: "அ. 1894",
      opt1: "அ. 1894",
      opt2: "ஆ. 1895",
      opt3: "இ. 1896",
      opt4: "ஈ. 1897",
      qn9: "____ ஆண்டில் ஜப்பான் சீனாவுடன் வலுக்கட்டாயமாகப் போரிட்டது.",
    },
    {
      ans: "ஆ. லண்டன்",
      opt1: "அ. இத்தாலி",
      opt2: "ஆ. லண்டன்",
      opt3: "இ. பிரான்ஸ்",
      opt4: "ஈ. ரஷ்யா",
      qn10: "1913ஆம் ஆண்டு மே மாதம் மையெழுத்திடப்பட்ட _______  உடன்படிக்கையின்படி அல்பேனியா எனும் புதியநாடு உருவாக்கப்பட்டது.",
    },
    {
      ans: "இ. 1902",
      opt1: "அ. 1903",
      opt2: "ஆ. 1904",
      opt3: "இ. 1902",
      opt4: "ஈ. 1901",
      qn11: "_____ ஆண்டில் ஜப்பான் இங்கிலாந்துடன் நட்பிணை ஒப்பந்தம் செய்து கொண்டது.",
    },
    {
      ans: "அ. மாசிடோனியா",
      opt1: "அ. மாசிடோனியா",
      opt2: "ஆ. ரஷ்யா",
      opt3: "இ. பிரான்ஸ்",
      opt4: "ஈ. இத்தாலி",
      qn12: "பால்கனில் _______ நாடு பல்வகை இனமக்களைக் கொண்டிருந்தது.",
    },
    {
      ans: "ஆ. ரஷ்யா",
      opt1: "அ. ஜெர்மனி",
      opt2: "ஆ. ரஷ்யா",
      opt3: "இ. இத்தாலி",
      opt4: "ஈ. அமெரிக்கா",
      qn13: "டானென்பர்க் போரில் _______ பேரிழப்புகளுக்கு உள்ளானது.",
    },
    {
      ans: "அ. கிளமென்சோ",
      opt1: "அ. கிளமென்சோ",
      opt2: "ஆ. ஜெர்மன் பேரரசர்",
      opt3: "இ. சிசில் ரோட்ஸ்",
      opt4: "ஈ. வில்சன்",
      qn14: "பாரிஸ் அமைதி மாநாட்டில் பிரதிநிதியாகப் பங்கேற்ற பிரான்ஸின் பிரதமர் _____ ஆவார்.",
    },
    {
      ans: "ஆ. கெரன்ஸ்கி",
      opt1: "அ. கிளமென்சோ",
      opt2: "ஆ. கெரன்ஸ்கி",
      opt3: "இ. வில்சன்",
      opt4: "ஈ. சிசில் ரோட்ஸ்",
      qn15: "லெனின் போல்ஷ்விக் அரசை நிறுவுவதற்கு முன்னர், தாராளவாதிகள், மிதவாதிகள், சோஷலிஸ்ட்கள் ஆகியோரின் புதிய கூட்டணிக்கு ________ பிரதமராக தலைமை ஏற்றார்.",
    },
    {
      ans: "இ. 1925",
      opt1: "அ. 1920",
      opt2: "ஆ. 1915",
      opt3: "இ. 1925",
      opt4: "ஈ. 1930",
      qn16: "__________ ஆண்டில் லொக்கர்னோ உடன்படிக்கை கையெழுத்திடப்பட்டது.",
    },
    {
      ans: "ஆ. அமெரிக்கா",
      opt1: "அ. பிரான்ஸ்",
      opt2: "ஆ. அமெரிக்கா",
      opt3: "இ. ஜப்பான்",
      opt4: "ஈ. துருக்கி",
      qn17: "1920ல் ________ தனித்திருக்கும் கொள்கையை பின்பற்றத் தொடங்கியது.",
    },
    {
      ans: "ஈ. சுவிட்சர்லாந்து",
      opt1: "அ. மாஸ்கோ",
      opt2: "ஆ. பாரிஸ்",
      opt3: "இ. லண்டன்",
      opt4: "ஈ. சுவிட்சர்லாந்து",
      qn18: "புரட்சி வெடித்த போது லெனின் ______ ல் இருந்தார்.",
    },
    {
      ans: "ஈ. சென்னை",
      opt1: "அ. பேர்ல்",
      opt2: "ஆ. ஜூட்லேண்டு",
      opt3: "இ. அல்சேஸ்",
      opt4: "ஈ. சென்னை",
      qn19: "எம்டன் _________ மீது குண்டுகளை வீசியது.",
    },
    {
      ans: "அ. ஜிங்கோயிசம்",
      opt1: "அ. ஜிங்கோயிசம்",
      opt2: "ஆ. சாவினிசம்",
      opt3: "இ. கல்குர்",
      opt4: "ஈ. நிகிலிசம்",
      qn20: "____ இங்கிலாந்தின் வன்முறை சார்ந்த தேசியம்.",
    },
  ]);

  const [pos, setPos] = useState(0);

  
  useEffect( () => {
    console.log(pos);
      if(pos >  myData.length){
          setPos(0)
          alert('its over')
      }
  } , [pos]) 

  return (
    <div>
      <Button onClick={() => setPos(pos > 19 ? 1 : pos + 1)}> Next </Button>
      <Typography> {myData[pos][`qn${pos > 19 ? 1 : pos + 1}`]} </Typography>
      <Typography> {myData[pos]['opt1']} </Typography>
      <Typography> {myData[pos]['opt2']} </Typography>
      <Typography> {myData[pos]['opt3']} </Typography>
      <Typography> {myData[pos]['opt4']} </Typography>


    </div>
  );
}


/**
 *      
 *      `current position : ${position} `
 * 
 */